app/controllers/stories_controller.rb

DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 1]]
---
  def destroy
    @story.destroy